Revit 2026 API

# RebarUpdateCurvesData Class

---

Class holding the information needed to calculate the rebar curves.

SystemObject Autodesk.Revit.DB.StructureRebarUpdateCurvesData

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class RebarUpdateCurvesData : IDisposable
```
```vb
Public Class RebarUpdateCurvesData
	Implements IDisposable
```
```cpp
public ref class RebarUpdateCurvesData : IDisposable
```
```fsharp
type RebarUpdateCurvesData =
    class
        interface IDisposable
    end
```

The RebarUpdateCurvesData type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | AlignedFreeFormSetOrientationOptions | Orientation options for an Aligned Free Form Rebar set. |
|  | AreOrientationOptionsChanged | Indicates if the orientation options have changed since the last regeneration. |
|  | AreWorkshopInstructionsChanged | Indicates if the workshop instructions have changed since the last regeneration. |
|  | CycleCounterChanged | True if the cycle counter was changed, false otherwise.The cycle counter value is changed when the free form Rebar element is selected and the user press Space key -or- by through [!:Autodesk::Revit::DB::Structure::RebarRebarFreeFormAccessor::CycleCounter] property. -or- by the server if it considers that the counter reaches the maximum value and reset it (set it to 0). |
|  | ErrorMessage | The reason for calculation failure. If the calculation fails, this message will be shown in an error, or warning if we are editing the constraints. |
|  | HostMirrored | If true, then host of the rebar was mirrorred (along with the rebar) before this regeneration. |
|  | IsAttachmentTypeChanged | Indicates if the attachment type has changed since the last regeneration. |
|  | IsBarsNumberChanged | Indicates if the bar number has changed since the last regeneration. |
|  | IsBendingRadiusChanged | Indicates if the bending radius has changed since the last regeneration. |
|  | IsEndConstraintChanged | Indicates if the end handle constraint has changed since the last regeneration. |
|  | IsLayoutChanged | Indicates if the layout has changed since the last regeneration. |
|  | IsReversed | Used to store the state of the bar refering to the direction of the bars. This is useful when using face intersection to calculate bars. After mirroring, curves created from intersecting faces may be reversed, so we use this to store the state and keep the rebar pointing in the correct direction. |
|  | IsSpacingChanged | Indicates if the spacing has changed since the last regeneration. |
|  | IsStartConstraintChanged | Indicates if the start handle constraint has changed since the last regeneration. |
|  | IsStyleChanged | Indicates if the style has changed since the last regeneration. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | Spacing | The spacing between the bars, according to the LayoutRule. |
|  | WorkshopInstructions | Identifies the workshop instructions of this rebar. |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Releases all resources used by the RebarUpdateCurvesData |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetAttachmentType | Returns attachment type for stirrups to be used in cover calculation. |
|  | GetBarGeometry | Returns the geometry for a bar at the specified index currently in the Rebar. |
|  | GetBarModelDiameter | Gets the model diameter of the Rebar. |
|  | GetBarNominalDiameter | Gets the nominal diameter of the Rebar. |
|  | GetBarsNumber | Gets the number of bars specified in the layout options. This is used to calculate the sets driven by bar number. |
|  | GetBendingRadius | Gets the current bending radius of the rebar. |
|  | GetChangedCustomHandles | Returns an array containing custom handles that were changed since the last regeneration. Array is empty if no handles were changed since the last regeneration. |
|  | GetChangedSharedParameterGUIDs | Returns an array containing the shared parameter GUIDs that were changed since the last regeneration. Array is empty if no shared params were changed since the last regeneration. |
|  | GetCustomConstraints | Gets all rebar constraints that are attached to custom handles for this rebar. |
|  | GetCycleCounter | Gets the cycle counter that is stored in the rebar. |
|  | GetDocument | Gets a reference to the current document. |
|  | GetEndConstraint | Gets the current constraint for the end handle of the Rebar. |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetHookOrientationAngle | **Obsolete.** Get the termination's rotation angle at end that is currently in the rebar. The angle is used for both hook and crank. |
|  | GetHookPlaneNormalForBarIdx | **Obsolete.** Returns the plane's normal in which the termination at end of bar with index barPositionIndex that is currently in Rebar. The normal is used for both hook and crank. |
|  | GetHostId | Gets the id of the host structural for this rebar. |
|  | GetLayoutRule | Gets the layout rule for this bar. |
|  | GetNumberOfBars | Returns the number of bars currently in the rebar. |
|  | GetRebarId | Get the id of the Rebar element currently being calculated. |
|  | GetRebarStyle | Gets the style of the rebar. |
|  | GetStartConstraint | Gets the current constraint for the start handle of the Rebar. |
|  | GetTerminationPlaneNormalForBarIdx | Gets the plane's normal in which the termination (e.g. hook, crank) at end of bar with index barPositionIndex that is currently in Rebar. |
|  | GetTerminationRotationAngle | Gets the termination's (e.g hook, crank) rotation angle (in radians) at end that is currently in the rebar. |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | SetCycleCounter | Sets the cycle counter to a specific value. |
|  | SetHookOrientationAngle | **Obsolete.** Sets the termination's rotation angle at end. The angle will be used for both hook and crank. This information is set to the rebar after the API execution is finished successfully. |
|  | SetHookPlaneNormalForBarIdx | **Obsolete.** Sets the plane's normal in which the termination at end of bar with index barPositionIndex will stay. The normal will be used for both hook and crank. This information is set to the rebar after the API execution is finished successfully. |
|  | SetTerminationPlaneNormalForBarIdx | Sets the plane's normal in which the termination (e.g. hook, crank) at end of bar with index barPositionIndex will stay. This information is set to the rebar after the API execution is finished successfully. |
|  | SetTerminationRotationAngle | Sets the termination's (e.g hook, crank) rotation angle (in radians) at end. This information is set to the rebar after the API execution is finished successfully. |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

Autodesk.Revit.DB.Structure Namespace